spezifikation-feuerstein.org

# File:     spezifikation-feuerstein.org
# Author:   wost@ewost.de

# Log: 2020-01-23 Datei erzeugt
#      2020-03-26, 2020-04-03, 2020-04-16: aktualisiert
#      2020-05-03 aktualisiert


* Worum geht es?
Das Projekt mit dem Arbeitsnamen "Feuerstein" soll es Forth-Einsteigern leicht
machen, mit der neuen Materie vertraut zu werden. Typische Hindernisse und
Fallstricke werden vermieden. Die Benutzererfahrung steht ganz oben auf der Liste.
Das gelieferte Paket hat den Anspruch, komplett zu sein.
In einer Schachtel befinden sich die teilbestückte Hauptplatine, Bauteile zum
Komplettieren der Schaltung, USB-Seriell-Wandler, USB-Kabel sowie Dokumentation
in Papier- und elekronischer Form. Zur Inbetriebnahme des Systems ist ein PC mit
Linux, MacOS oder Windows erforderlich. Eventuell wird auch Android unterstützt.
Ein Internetzugang wird für den Start nicht benötigt, ist aber später für die
Aktualisierung des Systems zu empfehlen.


* Eigenschaften
** Open Source Software
   - Alles als Quelltext verfügbar
** Open Source Hardware
   - PCB-Designfiles (Schematic, Board, Gerber) im Kicad-Format verfügbar
   - Bill of Material incl. Einkaufsquellen verfügbar
** Webseite
   - Projektwebseite, erzeugt durch Sphinx
** Voller Support
   - Ansprechpartner
   - Ersatz defekter Hardware


* Fragen
  - Wer hilft?
  - Wer testet, gibt Feedback?
  - Wieviel darf ein Streuartikel in der Herstellung kosten?
  - Wieviel kostet das Komplettset?
  - Finanzierung durch Verein?


* Aufgaben [1/8]
** TODO Zielgruppe definieren
   - Hardware-Kenntnis
     + [ ] keinen Schimmer
     + [ ] Grundkenntnis Elektronik
     + [ ] Fundierte Kenntnis Elektronik
     + [ ] Grundkenntnis Mikrocontroller / Digitaltechnik
     + [ ] Fundierte Kenntnis Mikrocontroller / Digitaltechnik
   - Programmier-Kenntnis
     + [ ] keinen Schimmer
     + [ ] erste Programmiersprache Forth
     + [ ] mindestens eine Programmiersprache gelernt
     + [ ] Programmierfreak, alle gängigen Programmiersprachen fließend
   - Personengruppen
     + [ ] Hardwarebastler auf der Suche nach einer geeigneten Programmiersprache
     + [ ] Lehrer, Dozenten (Multiplikatoren)
     + [ ] Schüler
     + [ ] Studenten
     + [ ] Hacker / Maker
     + [ ] Forthkenner mit Spieltrieb
     + [ ] Rentner

** DONE Sprache
   - [ ] Quelltext-Kommentare: Deutsch
   - [X] Quelltext-Kommentare: Englisch
   - [ ] Hilfetexte: Deutsch
   - [X] Hilfetexte: Englisch
   - [X] Dokumentation: erst Deutsch, dann Englisch (deepl.com)
   - [ ] Dokumentation: erst Englisch, dann Deutsch

** TODO Schreibstil Dokumentation festlegen
   - Leseransprache: 
     + Du hast dir bestimmt schon ...
     + Wir kümmern uns heute um die SPI-Schnittstelle und ...
     + Sie könnten die Daten auch über die ...
   - Humor
     + ernst
     + wissenschaftlich
     + streng

** TODO Codestil festlegen
   Ist es sinnvoll, einen einheitlichen Codestil festzulegen oder ist das im
   Umfeld von Forth nicht praktikabel?
   Wenn ein einheitlicher Stil, wie sieht der aus?
   - Einrückung
   - Namen
   - Dateiendungen .fs
   - max. Zeilenlänge 80?

** TODO Einarbeiten in Werkzeuge [0/11]
*** TODO Python
    - [ ] Pyserial
    - [ ] serielles Terminal
    - [ ] Flasher
