spezifikation-feuerstein.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="de" xml:lang="de">
<head>
<title>spezifikation-feuerstein</title>
<!-- 2020-05-03 So 22:27 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Wolfgang" />
</head>
<body>
<div id="content">
<h1 class="title">spezifikation-feuerstein</h1>
<div id="table-of-contents">
<h2>Inhaltsverzeichnis</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Worum geht es?</a></li>
<li><a href="#sec-2">2. Eigenschaften</a>
<ul>
<li><a href="#sec-2-1">2.1. Open Source Software</a></li>
<li><a href="#sec-2-2">2.2. Open Source Hardware</a></li>
<li><a href="#sec-2-3">2.3. Webseite</a></li>
<li><a href="#sec-2-4">2.4. Voller Support</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Fragen</a></li>
<li><a href="#sec-4">4. Aufgaben <code>[1/8]</code></a>
<ul>
<li><a href="#sec-4-1">4.1. <span class="todo TODO">TODO</span> Zielgruppe definieren</a></li>
<li><a href="#sec-4-2">4.2. <span class="done DONE">DONE</span> Sprache</a></li>
<li><a href="#sec-4-3">4.3. <span class="todo TODO">TODO</span> Schreibstil Dokumentation festlegen</a></li>
<li><a href="#sec-4-4">4.4. <span class="todo TODO">TODO</span> Codestil festlegen</a></li>
<li><a href="#sec-4-5">4.5. <span class="todo TODO">TODO</span> Einarbeiten in Werkzeuge <code>[0/11]</code></a>
<ul>
<li><a href="#sec-4-5-1">4.5.1. <span class="todo TODO">TODO</span> Python</a></li>
<li><a href="#sec-4-5-2">4.5.2. <span class="todo TODO">TODO</span> Emacs</a></li>
<li><a href="#sec-4-5-3">4.5.3. <span class="todo TODO">TODO</span> Sphinx</a></li>
<li><a href="#sec-4-5-4">4.5.4. <span class="todo TODO">TODO</span> Git</a></li>
<li><a href="#sec-4-5-5">4.5.5. <span class="todo TODO">TODO</span> Github</a></li>
<li><a href="#sec-4-5-6">4.5.6. <span class="todo TODO">TODO</span> serielle Terminals</a></li>
<li><a href="#sec-4-5-7">4.5.7. <span class="todo TODO">TODO</span> KiCAD</a></li>
<li><a href="#sec-4-5-8">4.5.8. <span class="todo TODO">TODO</span> Mecrisp Quintus</a></li>
<li><a href="#sec-4-5-9">4.5.9. <span class="todo TODO">TODO</span> VIS</a></li>
<li><a href="#sec-4-5-10">4.5.10. <span class="todo TODO">TODO</span> Forth-Cloud (NextCloud)</a></li>
<li><a href="#sec-4-5-11">4.5.11. <span class="todo TODO">TODO</span> Kommunikation</a></li>
</ul>
</li>
<li><a href="#sec-4-6">4.6. <span class="todo TODO">TODO</span> Zusammenarbeit mit HCC!Forth (Willem, Albert)</a></li>
<li><a href="#sec-4-7">4.7. <span class="todo TODO">TODO</span> andere Projekte anschauen <code>[0/5]</code></a>
<ul>
<li><a href="#sec-4-7-1">4.7.1. <span class="todo TODO">TODO</span> Egel-Project</a></li>
<li><a href="#sec-4-7-2">4.7.2. <span class="todo TODO">TODO</span> JeeLabs</a></li>
<li><a href="#sec-4-7-3">4.7.3. <span class="todo TODO">TODO</span> FlashForth</a></li>
<li><a href="#sec-4-7-4">4.7.4. <span class="todo TODO">TODO</span> Buch "Die Programmiersprache Forth" (Albert Nijhof)</a></li>
<li><a href="#sec-4-7-5">4.7.5. <span class="todo TODO">TODO</span> Gforth</a></li>
</ul>
</li>
<li><a href="#sec-4-8">4.8. <span class="todo TODO">TODO</span> Chip GD32VF103 <code>[0/5]</code></a>
<ul>
<li><a href="#sec-4-8-1">4.8.1. <span class="todo TODO">TODO</span> Interrupts</a></li>
<li><a href="#sec-4-8-2">4.8.2. <span class="todo TODO">TODO</span> Events</a></li>
<li><a href="#sec-4-8-3">4.8.3. <span class="todo TODO">TODO</span> Sleep Modes</a></li>
<li><a href="#sec-4-8-4">4.8.4. <span class="todo TODO">TODO</span> SPI</a></li>
<li><a href="#sec-4-8-5">4.8.5. <span class="todo TODO">TODO</span> I2C</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-5">5. Hardware</a>
<ul>
<li><a href="#sec-5-1">5.1. Board Longan Nano</a></li>
<li><a href="#sec-5-2">5.2. Board Seeed Studio RISC-V Dev. Board mit LCD 320x240</a></li>
<li><a href="#sec-5-3">5.3. Board Polos GD32V Alef von Analoglamb</a></li>
<li><a href="#sec-5-4">5.4. Board Eigenentwicklung</a>
<ul>
<li><a href="#sec-5-4-1">5.4.1. Hauptplatine, teilbestückt</a></li>
<li><a href="#sec-5-4-2">5.4.2. lose Teile zum Selbsteinlöten</a></li>
</ul>
</li>
<li><a href="#sec-5-5">5.5. USB-Seriell-Wandler</a></li>
<li><a href="#sec-5-6">5.6. weitere Teile im Paket</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Software</a>
<ul>
<li><a href="#sec-6-1">6.1. Firmware auf dem Chip/Board</a>
<ul>
<li><a href="#sec-6-1-1">6.1.1. Mecrisp Quintus</a></li>
<li><a href="#sec-6-1-2">6.1.2. Forth-Bibliothek</a></li>
<li><a href="#sec-6-1-3">6.1.3. Interaktives "Schweizer Taschenmesser"</a></li>
<li><a href="#sec-6-1-4">6.1.4. VIS-System</a></li>
<li><a href="#sec-6-1-5">6.1.5. History-Buffer</a></li>
<li><a href="#sec-6-1-6">6.1.6. Auto-Vervollständigung</a></li>
<li><a href="#sec-6-1-7">6.1.7. Eingebautes Hilfesystem im SPI-Flash</a></li>
<li><a href="#sec-6-1-8">6.1.8. Forth-Beispieldateien</a></li>
<li><a href="#sec-6-1-9">6.1.9. Interaktives Tutorial (macht Carsten)</a></li>
</ul>
</li>
<li><a href="#sec-6-2">6.2. auf dem PC</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Dokumentation</a>
<ul>
<li><a href="#sec-7-1">7.1. Heft: Schnelleinstieg (erste Schritte) für den Ungeduldigen</a></li>
<li><a href="#sec-7-2">7.2. Buchreihe: Mecrisp Quintus</a>
<ul>
<li><a href="#sec-7-2-1">7.2.1. Buch1: Tutorial</a></li>
<li><a href="#sec-7-2-2">7.2.2. Buch2: Benutzerhandbuch</a></li>
<li><a href="#sec-7-2-3">7.2.3. Buch3: Referenzhandbuch</a></li>
</ul>
</li>
<li><a href="#sec-7-3">7.3. Buch: Der Mikrocontroller GD32VF103</a></li>
<li><a href="#sec-7-4">7.4. Buch: Kochbuch / Rezepte</a></li>
<li><a href="#sec-7-5">7.5. Hardware Benutzerhandbuch</a></li>
<li><a href="#sec-7-6">7.6. Datenblätter / Benutzerhandbücher verwendeter Bausteine</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Worum geht es?</h2>
<div class="outline-text-2" id="text-1">
<p>
Das Projekt mit dem Arbeitsnamen "Feuerstein" soll es Forth-Einsteigern leicht
machen, mit der neuen Materie vertraut zu werden. Typische Hindernisse und
Fallstricke werden vermieden. Die Benutzererfahrung steht ganz oben auf der Liste.
Das gelieferte Paket hat den Anspruch, komplett zu sein.
In einer Schachtel befinden sich die teilbestückte Hauptplatine, Bauteile zum
Komplettieren der Schaltung, USB-Seriell-Wandler, USB-Kabel sowie Dokumentation
in Papier- und elekronischer Form. Zur Inbetriebnahme des Systems ist ein PC mit
Linux, MacOS oder Windows erforderlich. Eventuell wird auch Android unterstützt.
Ein Internetzugang wird für den Start nicht benötigt, ist aber später für die
Aktualisierung des Systems zu empfehlen.
</p>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Eigenschaften</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Open Source Software</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Alles als Quelltext verfügbar
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Open Source Hardware</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>PCB-Designfiles (Schematic, Board, Gerber) im Kicad-Format verfügbar
</li>
<li>Bill of Material incl. Einkaufsquellen verfügbar
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Webseite</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Projektwebseite, erzeugt durch Sphinx
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Voller Support</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>Ansprechpartner
</li>
<li>Ersatz defekter Hardware
</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Fragen</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Wer hilft?
</li>
<li>Wer testet, gibt Feedback?
</li>
<li>Wieviel darf ein Streuartikel in der Herstellung kosten?
</li>
<li>Wieviel kostet das Komplettset?
</li>
<li>Finanzierung durch Verein?
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Aufgaben <code>[1/8]</code></h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> <span class="todo TODO">TODO</span> Zielgruppe definieren</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Hardware-Kenntnis
<ul class="org-ul">
<li><code>[&#xa0;]</code> keinen Schimmer
</li>
<li><code>[&#xa0;]</code> Grundkenntnis Elektronik
</li>
<li><code>[&#xa0;]</code> Fundierte Kenntnis Elektronik
</li>
<li><code>[&#xa0;]</code> Grundkenntnis Mikrocontroller / Digitaltechnik
</li>
<li><code>[&#xa0;]</code> Fundierte Kenntnis Mikrocontroller / Digitaltechnik
</li>
</ul>
</li>
<li>Programmier-Kenntnis
<ul class="org-ul">
<li><code>[&#xa0;]</code> keinen Schimmer
</li>
<li><code>[&#xa0;]</code> erste Programmiersprache Forth
</li>
<li><code>[&#xa0;]</code> mindestens eine Programmiersprache gelernt
</li>
<li><code>[&#xa0;]</code> Programmierfreak, alle gängigen Programmiersprachen fließend
</li>
</ul>
</li>
<li>Personengruppen
<ul class="org-ul">
<li><code>[&#xa0;]</code> Hardwarebastler auf der Suche nach einer geeigneten Programmiersprache
</li>
<li><code>[&#xa0;]</code> Lehrer, Dozenten (Multiplikatoren)
</li>
<li><code>[&#xa0;]</code> Schüler
</li>
<li><code>[&#xa0;]</code> Studenten
</li>
<li><code>[&#xa0;]</code> Hacker / Maker
</li>
<li><code>[&#xa0;]</code> Forthkenner mit Spieltrieb
</li>
<li><code>[&#xa0;]</code> Rentner
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> <span class="done DONE">DONE</span> Sprache</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Quelltext-Kommentare: Deutsch
</li>
<li><code>[X]</code> Quelltext-Kommentare: Englisch
</li>
<li><code>[&#xa0;]</code> Hilfetexte: Deutsch
</li>
<li><code>[X]</code> Hilfetexte: Englisch
</li>
<li><code>[X]</code> Dokumentation: erst Deutsch, dann Englisch (deepl.com)
</li>
<li><code>[&#xa0;]</code> Dokumentation: erst Englisch, dann Deutsch
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> <span class="todo TODO">TODO</span> Schreibstil Dokumentation festlegen</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>Leseransprache: 
<ul class="org-ul">
<li>Du hast dir bestimmt schon &#x2026;
</li>
<li>Wir kümmern uns heute um die SPI-Schnittstelle und &#x2026;
</li>
<li>Sie könnten die Daten auch über die &#x2026;
</li>
</ul>
</li>
<li>Humor
<ul class="org-ul">
<li>ernst
</li>
<li>wissenschaftlich
</li>
<li>streng
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> <span class="todo TODO">TODO</span> Codestil festlegen</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Ist es sinnvoll, einen einheitlichen Codestil festzulegen oder ist das im
Umfeld von Forth nicht praktikabel?
Wenn ein einheitlicher Stil, wie sieht der aus?
</p>
<ul class="org-ul">
<li>Einrückung
</li>
<li>Namen
</li>
<li>Dateiendungen .fs
</li>
<li>max. Zeilenlänge 80?
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> <span class="todo TODO">TODO</span> Einarbeiten in Werkzeuge <code>[0/11]</code></h3>
<div class="outline-text-3" id="text-4-5">
</div><div id="outline-container-sec-4-5-1" class="outline-4">
<h4 id="sec-4-5-1"><span class="section-number-4">4.5.1</span> <span class="todo TODO">TODO</span> Python</h4>
<div class="outline-text-4" id="text-4-5-1">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Pyserial
</li>
<li><code>[&#xa0;]</code> serielles Terminal
</li>
<li><code>[&#xa0;]</code> Flasher
</li>
</ul>
</div>
</div>
