spezifikation-feuerstein.org
*** TODO Emacs
    - [ ] Grundfunktionen
    - [ ] Org-Mode
    - [ ] Diff-Tool emerge, smerge-mode, ediff
    - [ ] Export HTML
    - [ ] Export PDF 
*** TODO Sphinx
    - [ ] Doku lesen
    - [ ] Read The Docs
*** TODO Git
    - [ ] Grundlagen
    - [ ] Arbeit lokal
    - [ ] Synchronisation Server
*** TODO Github
    - [ ] Fork
    - [ ] Clone
    - [ ] Push
    - [ ] Pull
    - [ ] Pull Request
*** TODO serielle Terminals
    - [ ] e4thcom  (Linux/Win10/Mac)
    - [ ] minicom  (Linux/Win10/Mac)
    - [ ] Picocom  (Linux/Win10/Mac)
    - [ ] TeraTerm (Win10 only)
*** TODO KiCAD
    - [ ] Schaltplan
    - [ ] PCB
    - [ ] Bibliotheken
    - [ ] Gerber
*** TODO Mecrisp Quintus
    - [ ] unofficial Dokumentation Terry Porter
*** TODO VIS
    - [ ] Doku lesen
    - [ ] Tutorial durscharbeiten
*** TODO Forth-Cloud (NextCloud)
    - [ ] Bedienung
*** TODO Kommunikation
    - [ ] Zoom
    - [ ] Jitsi
    - [ ] EtherPad

** TODO Zusammenarbeit mit HCC!Forth (Willem, Albert)
   - Funktionsweise GD32VF103

** TODO andere Projekte anschauen [0/5]
*** TODO Egel-Project
    - erste Version mit 8051-MCU
    - aktuelle Version mit MSP430
*** TODO JeeLabs
    - Forth-Artikel
    - Code
*** TODO FlashForth
    - Dokumentation Bergbau-Uni Australien
*** TODO Buch "Die Programmiersprache Forth" (Albert Nijhof)
*** TODO Gforth
    - Tutorial
    - Dokumentation

** TODO Chip GD32VF103 [0/5]
*** TODO Interrupts
*** TODO Events
*** TODO Sleep Modes
*** TODO SPI
*** TODO I2C


* Hardware
** Board Longan Nano
   - Platine mit GD32VF103 (48 Pin), LCD 160x80
   - Standard-Entwicklungsumgebung des Projektes
** Board Seeed Studio RISC-V Dev. Board mit LCD 320x240
   - Platine mit GD32VF103VBT6 (100 Pin), 8 MB ser. Flash, 256 Bytes EEprom
   - Option:  LCD 320x240 (Dadurch Standalone-Betrieb möglich)
** Board Polos GD32V Alef von Analoglamb
   - Platine mit GD32VF103CBT6 (48 Pin)
   - Keines Board mit dem Nötigsten (33mm x 33mm)
** Board Eigenentwicklung
*** Hauptplatine, teilbestückt
    - PCB
    - RISC-V GD32VF103
    - Spannungsregler
    - Quarze 8 MHz und 32,768 kHz
    - 8 MB SPI-Flash
    - USB-Buchse
*** lose Teile zum Selbsteinlöten
    - Taster
    - LEDs
    - Pufferzelle für Echtzeituhr (Batterie oder Supercap)
    - Pmod Steckerleisten
    - Schaltkreis zum Vermessen von Bauteilen wie Transistor,
        Diode, Widerstand, Kondensator, Spule

** USB-Seriell-Wandler
   - galvanische Trennung
   - Chip CP2102N
   - Hardware-Handshake
   - Pmod, lose
   - USB-Kabel (Mikro-USB oder USB-C)

** weitere Teile im Paket
   - Fototransistor
   - Potentiometer
   - Pmod-Kabel
   - lose Kabel Buchse/Buchse, verschiedene Längen


* Software
** Firmware auf dem Chip/Board
*** Mecrisp Quintus
    - Assembler
    - Disassembler
    - Fixkomma-Routinen
    - Bedingte Compilierung
*** Forth-Bibliothek
    - USB, USB-OTG
    - SPI, I2C, UART, FIFO
    - CAN
    - Interrupt
    - Timer
    - SD-Karte, SPI-Flash
    - ADC, DAC
    - RTC
*** Interaktives "Schweizer Taschenmesser"
    - Messfunktionen
    - Signalgenerator
    - Protokollanalysator für UART, SPI, I2C, CAN    
*** VIS-System
    Vocs, Items, Sticky words von Manfred
*** History-Buffer
    Speichert die letzten 20 Eingaben. Quintus hat TIB von max. 200 Zeichen.
    Tricky: Quelltextdownload soll nicht im History-Buffer landen.
*** Auto-Vervollständigung
    - Dictionary-Einträge
    - selbst definierte Floskeln
