spezifikation-feuerstein.html
<div id="outline-container-sec-4-5-2" class="outline-4">
<h4 id="sec-4-5-2"><span class="section-number-4">4.5.2</span> <span class="todo TODO">TODO</span> Emacs</h4>
<div class="outline-text-4" id="text-4-5-2">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Grundfunktionen
</li>
<li><code>[&#xa0;]</code> Org-Mode
</li>
<li><code>[&#xa0;]</code> Diff-Tool emerge, smerge-mode, ediff
</li>
<li><code>[&#xa0;]</code> Export HTML
</li>
<li><code>[&#xa0;]</code> Export PDF 
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-5-3" class="outline-4">
<h4 id="sec-4-5-3"><span class="section-number-4">4.5.3</span> <span class="todo TODO">TODO</span> Sphinx</h4>
<div class="outline-text-4" id="text-4-5-3">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Doku lesen
</li>
<li><code>[&#xa0;]</code> Read The Docs
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-5-4" class="outline-4">
<h4 id="sec-4-5-4"><span class="section-number-4">4.5.4</span> <span class="todo TODO">TODO</span> Git</h4>
<div class="outline-text-4" id="text-4-5-4">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Grundlagen
</li>
<li><code>[&#xa0;]</code> Arbeit lokal
</li>
<li><code>[&#xa0;]</code> Synchronisation Server
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-5-5" class="outline-4">
<h4 id="sec-4-5-5"><span class="section-number-4">4.5.5</span> <span class="todo TODO">TODO</span> Github</h4>
<div class="outline-text-4" id="text-4-5-5">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Fork
</li>
<li><code>[&#xa0;]</code> Clone
</li>
<li><code>[&#xa0;]</code> Push
</li>
<li><code>[&#xa0;]</code> Pull
</li>
<li><code>[&#xa0;]</code> Pull Request
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-5-6" class="outline-4">
<h4 id="sec-4-5-6"><span class="section-number-4">4.5.6</span> <span class="todo TODO">TODO</span> serielle Terminals</h4>
<div class="outline-text-4" id="text-4-5-6">
<ul class="org-ul">
<li><code>[&#xa0;]</code> e4thcom  (Linux/Win10/Mac)
</li>
<li><code>[&#xa0;]</code> minicom  (Linux/Win10/Mac)
</li>
<li><code>[&#xa0;]</code> Picocom  (Linux/Win10/Mac)
</li>
<li><code>[&#xa0;]</code> TeraTerm (Win10 only)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-5-7" class="outline-4">
<h4 id="sec-4-5-7"><span class="section-number-4">4.5.7</span> <span class="todo TODO">TODO</span> KiCAD</h4>
<div class="outline-text-4" id="text-4-5-7">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Schaltplan
</li>
<li><code>[&#xa0;]</code> PCB
</li>
<li><code>[&#xa0;]</code> Bibliotheken
</li>
<li><code>[&#xa0;]</code> Gerber
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-5-8" class="outline-4">
<h4 id="sec-4-5-8"><span class="section-number-4">4.5.8</span> <span class="todo TODO">TODO</span> Mecrisp Quintus</h4>
<div class="outline-text-4" id="text-4-5-8">
<ul class="org-ul">
<li><code>[&#xa0;]</code> unofficial Dokumentation Terry Porter
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-5-9" class="outline-4">
<h4 id="sec-4-5-9"><span class="section-number-4">4.5.9</span> <span class="todo TODO">TODO</span> VIS</h4>
<div class="outline-text-4" id="text-4-5-9">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Doku lesen
</li>
<li><code>[&#xa0;]</code> Tutorial durscharbeiten
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-5-10" class="outline-4">
<h4 id="sec-4-5-10"><span class="section-number-4">4.5.10</span> <span class="todo TODO">TODO</span> Forth-Cloud (NextCloud)</h4>
<div class="outline-text-4" id="text-4-5-10">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Bedienung
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-5-11" class="outline-4">
<h4 id="sec-4-5-11"><span class="section-number-4">4.5.11</span> <span class="todo TODO">TODO</span> Kommunikation</h4>
<div class="outline-text-4" id="text-4-5-11">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Zoom
</li>
<li><code>[&#xa0;]</code> Jitsi
</li>
<li><code>[&#xa0;]</code> EtherPad
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> <span class="todo TODO">TODO</span> Zusammenarbeit mit HCC!Forth (Willem, Albert)</h3>
<div class="outline-text-3" id="text-4-6">
<ul class="org-ul">
<li>Funktionsweise GD32VF103
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="section-number-3">4.7</span> <span class="todo TODO">TODO</span> andere Projekte anschauen <code>[0/5]</code></h3>
<div class="outline-text-3" id="text-4-7">
</div><div id="outline-container-sec-4-7-1" class="outline-4">
<h4 id="sec-4-7-1"><span class="section-number-4">4.7.1</span> <span class="todo TODO">TODO</span> Egel-Project</h4>
<div class="outline-text-4" id="text-4-7-1">
<ul class="org-ul">
<li>erste Version mit 8051-MCU
</li>
<li>aktuelle Version mit MSP430
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-7-2" class="outline-4">
<h4 id="sec-4-7-2"><span class="section-number-4">4.7.2</span> <span class="todo TODO">TODO</span> JeeLabs</h4>
<div class="outline-text-4" id="text-4-7-2">
<ul class="org-ul">
<li>Forth-Artikel
</li>
<li>Code
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-7-3" class="outline-4">
<h4 id="sec-4-7-3"><span class="section-number-4">4.7.3</span> <span class="todo TODO">TODO</span> FlashForth</h4>
<div class="outline-text-4" id="text-4-7-3">
<ul class="org-ul">
<li>Dokumentation Bergbau-Uni Australien
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-7-4" class="outline-4">
<h4 id="sec-4-7-4"><span class="section-number-4">4.7.4</span> <span class="todo TODO">TODO</span> Buch "Die Programmiersprache Forth" (Albert Nijhof)</h4>
</div>
<div id="outline-container-sec-4-7-5" class="outline-4">
<h4 id="sec-4-7-5"><span class="section-number-4">4.7.5</span> <span class="todo TODO">TODO</span> Gforth</h4>
<div class="outline-text-4" id="text-4-7-5">
<ul class="org-ul">
<li>Tutorial
</li>
<li>Dokumentation
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-4-8" class="outline-3">
<h3 id="sec-4-8"><span class="section-number-3">4.8</span> <span class="todo TODO">TODO</span> Chip GD32VF103 <code>[0/5]</code></h3>
<div class="outline-text-3" id="text-4-8">
</div><div id="outline-container-sec-4-8-1" class="outline-4">
<h4 id="sec-4-8-1"><span class="section-number-4">4.8.1</span> <span class="todo TODO">TODO</span> Interrupts</h4>
</div>
<div id="outline-container-sec-4-8-2" class="outline-4">
<h4 id="sec-4-8-2"><span class="section-number-4">4.8.2</span> <span class="todo TODO">TODO</span> Events</h4>
</div>
<div id="outline-container-sec-4-8-3" class="outline-4">
<h4 id="sec-4-8-3"><span class="section-number-4">4.8.3</span> <span class="todo TODO">TODO</span> Sleep Modes</h4>
</div>
<div id="outline-container-sec-4-8-4" class="outline-4">
<h4 id="sec-4-8-4"><span class="section-number-4">4.8.4</span> <span class="todo TODO">TODO</span> SPI</h4>
</div>
<div id="outline-container-sec-4-8-5" class="outline-4">
<h4 id="sec-4-8-5"><span class="section-number-4">4.8.5</span> <span class="todo TODO">TODO</span> I2C</h4>
</div>
</div>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Hardware</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Board Longan Nano</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>Platine mit GD32VF103 (48 Pin), LCD 160x80
</li>
<li>Standard-Entwicklungsumgebung des Projektes
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Board Seeed Studio RISC-V Dev. Board mit LCD 320x240</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>Platine mit GD32VF103VBT6 (100 Pin), 8 MB ser. Flash, 256 Bytes EEprom
</li>
<li>Option:  LCD 320x240 (Dadurch Standalone-Betrieb möglich)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Board Polos GD32V Alef von Analoglamb</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li>Platine mit GD32VF103CBT6 (48 Pin)
</li>
<li>Keines Board mit dem Nötigsten (33mm x 33mm)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> Board Eigenentwicklung</h3>
<div class="outline-text-3" id="text-5-4">
</div><div id="outline-container-sec-5-4-1" class="outline-4">
<h4 id="sec-5-4-1"><span class="section-number-4">5.4.1</span> Hauptplatine, teilbestückt</h4>
<div class="outline-text-4" id="text-5-4-1">
<ul class="org-ul">
<li>PCB
</li>
<li>RISC-V GD32VF103
</li>
<li>Spannungsregler
</li>
<li>Quarze 8 MHz und 32,768 kHz
</li>
<li>8 MB SPI-Flash
</li>
<li>USB-Buchse
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-4-2" class="outline-4">
<h4 id="sec-5-4-2"><span class="section-number-4">5.4.2</span> lose Teile zum Selbsteinlöten</h4>
<div class="outline-text-4" id="text-5-4-2">
<ul class="org-ul">
<li>Taster
</li>
<li>LEDs
</li>
<li>Pufferzelle für Echtzeituhr (Batterie oder Supercap)
</li>
<li>Pmod Steckerleisten
</li>
<li>Schaltkreis zum Vermessen von Bauteilen wie Transistor,
Diode, Widerstand, Kondensator, Spule
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> USB-Seriell-Wandler</h3>
<div class="outline-text-3" id="text-5-5">
<ul class="org-ul">
<li>galvanische Trennung
</li>
<li>Chip CP2102N
</li>
<li>Hardware-Handshake
</li>
<li>Pmod, lose
</li>
<li>USB-Kabel (Mikro-USB oder USB-C)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> weitere Teile im Paket</h3>
<div class="outline-text-3" id="text-5-6">
<ul class="org-ul">
<li>Fototransistor
</li>
<li>Potentiometer
</li>
<li>Pmod-Kabel
</li>
<li>lose Kabel Buchse/Buchse, verschiedene Längen
</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Software</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Firmware auf dem Chip/Board</h3>
<div class="outline-text-3" id="text-6-1">
</div><div id="outline-container-sec-6-1-1" class="outline-4">
<h4 id="sec-6-1-1"><span class="section-number-4">6.1.1</span> Mecrisp Quintus</h4>
<div class="outline-text-4" id="text-6-1-1">
<ul class="org-ul">
<li>Assembler
</li>
<li>Disassembler
</li>
<li>Fixkomma-Routinen
</li>
<li>Bedingte Compilierung
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-1-2" class="outline-4">
<h4 id="sec-6-1-2"><span class="section-number-4">6.1.2</span> Forth-Bibliothek</h4>
<div class="outline-text-4" id="text-6-1-2">
<ul class="org-ul">
<li>USB, USB-OTG
</li>
<li>SPI, I2C, UART, FIFO
</li>
<li>CAN
</li>
<li>Interrupt
</li>
<li>Timer
</li>
<li>SD-Karte, SPI-Flash
</li>
<li>ADC, DAC
</li>
<li>RTC
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-1-3" class="outline-4">
<h4 id="sec-6-1-3"><span class="section-number-4">6.1.3</span> Interaktives "Schweizer Taschenmesser"</h4>
<div class="outline-text-4" id="text-6-1-3">
<ul class="org-ul">
<li>Messfunktionen
</li>
<li>Signalgenerator
</li>
<li>Protokollanalysator für UART, SPI, I2C, CAN    
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-1-4" class="outline-4">
<h4 id="sec-6-1-4"><span class="section-number-4">6.1.4</span> VIS-System</h4>
<div class="outline-text-4" id="text-6-1-4">
<p>
Vocs, Items, Sticky words von Manfred
</p>
</div>
</div>
<div id="outline-container-sec-6-1-5" class="outline-4">
<h4 id="sec-6-1-5"><span class="section-number-4">6.1.5</span> History-Buffer</h4>
<div class="outline-text-4" id="text-6-1-5">
<p>
Speichert die letzten 20 Eingaben. Quintus hat TIB von max. 200 Zeichen.
Tricky: Quelltextdownload soll nicht im History-Buffer landen.
</p>
</div>
</div>
<div id="outline-container-sec-6-1-6" class="outline-4">
<h4 id="sec-6-1-6"><span class="section-number-4">6.1.6</span> Auto-Vervollständigung</h4>
<div class="outline-text-4" id="text-6-1-6">
<ul class="org-ul">
<li>Dictionary-Einträge
</li>
<li>selbst definierte Floskeln
</li>
</ul>
</div>
</div>
