spezifikation-feuerstein.org
*** Eingebautes Hilfesystem im SPI-Flash
    - Sprache: Englisch, eventuell später auch eine Version Deutsch
    - Worte und ihre Funktion / Bedeutung
        (mit Beispiel-Quelltext zum Ausprobieren)
    - Registerbeschreibung und momentane Werte anzeigen / setzen
    - Verbose-Flag zur Umschaltung der Detailierung der Ausgabe
*** Forth-Beispieldateien
    - Blinkprogramm
    - Spiele
*** Interaktives Tutorial (macht Carsten)
    - User kann auf dem Chip Forth lernen

** auf dem PC
  - Entwicklungssystem
    + Program zum Flashen von Quintus (Python)
    + Selbstgeschriebene IDE (Python) nach Vorbild "5th"
    + Emacs incl. Syntax-Highlighting und Terminal
    + e4thcom (Manfreds Terminal)
    + picocom (Linux)
    + minicom (Linux)
    + Teraterm (Windows)
    + Mac ???


* Dokumentation
** Heft: Schnelleinstieg (erste Schritte) für den Ungeduldigen
   - Platine zusammenbauen
   - Einrichten einer Entwicklungsumgebung
   - Blinkprogramm starten und verändern

** Buchreihe: Mecrisp Quintus
*** Buch1: Tutorial
*** Buch2: Benutzerhandbuch
*** Buch3: Referenzhandbuch

** Buch: Der Mikrocontroller GD32VF103
   - Einführung Mikrocontroller
   - RISC-V Befehlssatz-Architektur
   - Pinbelegung Chip
   - CPU
   - Speicherorganisation
   - Reset
   - Interrupts / Events
   - Oszillator
   - Spezial-Funktionsregister
   - Ports
   - Timer
   - Serielle Schnittstellen
     - UART
     - SPI
     - I2C
   - ADC
   - Anhang
     + ASCII-Tabelle
     + Befehlssatz
     + Dezimal/Binär/Hex-Tabelle

** Buch: Kochbuch / Rezepte
   - Schrittmotor-Steuerung
   - Porterweiterung I2C
   - CAN-Bus-Interface
   - 1-Wire-Temperaturlogger
   - Larson-Scanner
   - Multitasking
   - Fixkomma-Arithmetik
   - Benutzerschnittstellen
   - 2x16 LCD
   - OLED 128x64
   - Matrix-Tastatur

** Hardware Benutzerhandbuch
   - Liste der Anschlüsse mit Beschreibung 
   - Schaltplan
   - Funktionsweise der Schaltung
   - Kurzbeschreibung Bausteine

** Datenblätter / Benutzerhandbücher verwendeter Bausteine
   - GD32VF103
   - SPI-Flash
   - CP2102N
