spezifikation-feuerstein.html
<div id="outline-container-sec-6-1-7" class="outline-4">
<h4 id="sec-6-1-7"><span class="section-number-4">6.1.7</span> Eingebautes Hilfesystem im SPI-Flash</h4>
<div class="outline-text-4" id="text-6-1-7">
<ul class="org-ul">
<li>Sprache: Englisch, eventuell später auch eine Version Deutsch
</li>
<li>Worte und ihre Funktion / Bedeutung
(mit Beispiel-Quelltext zum Ausprobieren)
</li>
<li>Registerbeschreibung und momentane Werte anzeigen / setzen
</li>
<li>Verbose-Flag zur Umschaltung der Detailierung der Ausgabe
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-1-8" class="outline-4">
<h4 id="sec-6-1-8"><span class="section-number-4">6.1.8</span> Forth-Beispieldateien</h4>
<div class="outline-text-4" id="text-6-1-8">
<ul class="org-ul">
<li>Blinkprogramm
</li>
<li>Spiele
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-1-9" class="outline-4">
<h4 id="sec-6-1-9"><span class="section-number-4">6.1.9</span> Interaktives Tutorial (macht Carsten)</h4>
<div class="outline-text-4" id="text-6-1-9">
<ul class="org-ul">
<li>User kann auf dem Chip Forth lernen
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> auf dem PC</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>Entwicklungssystem
<ul class="org-ul">
<li>Program zum Flashen von Quintus (Python)
</li>
<li>Selbstgeschriebene IDE (Python) nach Vorbild "5th"
</li>
<li>Emacs incl. Syntax-Highlighting und Terminal
</li>
<li>e4thcom (Manfreds Terminal)
</li>
<li>picocom (Linux)
</li>
<li>minicom (Linux)
</li>
<li>Teraterm (Windows)
</li>
<li>Mac ???
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Dokumentation</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Heft: Schnelleinstieg (erste Schritte) für den Ungeduldigen</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li>Platine zusammenbauen
</li>
<li>Einrichten einer Entwicklungsumgebung
</li>
<li>Blinkprogramm starten und verändern
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> Buchreihe: Mecrisp Quintus</h3>
<div class="outline-text-3" id="text-7-2">
</div><div id="outline-container-sec-7-2-1" class="outline-4">
<h4 id="sec-7-2-1"><span class="section-number-4">7.2.1</span> Buch1: Tutorial</h4>
</div>
<div id="outline-container-sec-7-2-2" class="outline-4">
<h4 id="sec-7-2-2"><span class="section-number-4">7.2.2</span> Buch2: Benutzerhandbuch</h4>
</div>
<div id="outline-container-sec-7-2-3" class="outline-4">
<h4 id="sec-7-2-3"><span class="section-number-4">7.2.3</span> Buch3: Referenzhandbuch</h4>
</div>
</div>

<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> Buch: Der Mikrocontroller GD32VF103</h3>
<div class="outline-text-3" id="text-7-3">
<ul class="org-ul">
<li>Einführung Mikrocontroller
</li>
<li>RISC-V Befehlssatz-Architektur
</li>
<li>Pinbelegung Chip
</li>
<li>CPU
</li>
<li>Speicherorganisation
</li>
<li>Reset
</li>
<li>Interrupts / Events
</li>
<li>Oszillator
</li>
<li>Spezial-Funktionsregister
</li>
<li>Ports
</li>
<li>Timer
</li>
<li>Serielle Schnittstellen
<ul class="org-ul">
<li>UART
</li>
<li>SPI
</li>
<li>I2C
</li>
</ul>
</li>
<li>ADC
</li>
<li>Anhang
<ul class="org-ul">
<li>ASCII-Tabelle
</li>
<li>Befehlssatz
</li>
<li>Dezimal/Binär/Hex-Tabelle
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7-4" class="outline-3">
<h3 id="sec-7-4"><span class="section-number-3">7.4</span> Buch: Kochbuch / Rezepte</h3>
<div class="outline-text-3" id="text-7-4">
<ul class="org-ul">
<li>Schrittmotor-Steuerung
</li>
<li>Porterweiterung I2C
</li>
<li>CAN-Bus-Interface
</li>
<li>1-Wire-Temperaturlogger
</li>
<li>Larson-Scanner
</li>
<li>Multitasking
</li>
<li>Fixkomma-Arithmetik
</li>
<li>Benutzerschnittstellen
</li>
<li>2x16 LCD
</li>
<li>OLED 128x64
</li>
<li>Matrix-Tastatur
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7-5" class="outline-3">
<h3 id="sec-7-5"><span class="section-number-3">7.5</span> Hardware Benutzerhandbuch</h3>
<div class="outline-text-3" id="text-7-5">
<ul class="org-ul">
<li>Liste der Anschlüsse mit Beschreibung 
</li>
<li>Schaltplan
</li>
<li>Funktionsweise der Schaltung
</li>
<li>Kurzbeschreibung Bausteine
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7-6" class="outline-3">
<h3 id="sec-7-6"><span class="section-number-3">7.6</span> Datenblätter / Benutzerhandbücher verwendeter Bausteine</h3>
<div class="outline-text-3" id="text-7-6">
<ul class="org-ul">
<li>GD32VF103
</li>
<li>SPI-Flash
</li>
<li>CP2102N
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Wolfgang</p>
<p class="date">Created: 2020-05-03 So 22:27</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
